package lessons_28.NestedExample;

public class NestedExample {
    //Вложенные - nested classes - Статические вложенные классы
    //Внутренние классы - inner classes - класс написанный внутри другого класса (не статический класс)

    /*
    1. Статический класс не имеет доступа к членам внешнего класса без явной передачи.
    Могут быть использованы независимо от внешнего класса

    2. Внутренние классы - имеют доступ ко всем полям и методам внешнего класса, даже если они объявлены (private)
     */


}
